# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0      640*640**32
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2 320*320*64
   [-1, 1, Conv, [64, 3, 1]],  #        320*320*64
   
   [-1, 1, Conv, [128, 3, 2]], # 3-P2/4 160**160**128
   #===========-ELAN-===========================================
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11 160*160*256
   #==========-MP-1-=============================================
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  80*80*256
   #=========-ELAN-==============================================
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24 80*80*512    ***************************to neck
   #=======-MP-1-==================================================
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16 40*40*512
   #=======-ELAN-===================================================
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37          40*40*1024 ******************************to neck
   #========-MP-1-===================================================
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  20*20*1024
   #========-ELAN-====================================================
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50 20*20*1024
  ]

# yolov7 head [24,37,51]
head:
  [[-1, 1, SPPCSPC, [512]], # 51                20*20*512 *********************************to neck
   [37, 1, Conv, [512, 3, 2]], #52              20*20*512
   [[-1, -2], 1, Concat, [1]], #53              20*20*1024
   [-1, 3, CSPStage, [512]],   #54              20*20*512

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #55   40*40*512
   [24, 1, Conv, [256, 3, 2]],                  #56   40*40*512
   [[-1, -2, 37], 1, Concat, [1]],              #57   40*40*1536
   [-1, 3, CSPStage, [512]],                   #58   40*40*512------

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #59 80*80*512
   [[-1, 24], 1, Concat, [1]],
   [-1, 3, CSPStage, [256]], #80*80*256                                    to head

   [-1, 1, Conv, [256, 3, 2]], #62  40*40*256
   [[-1, 58], 1, Concat, [1]], #63  40*40*768
   [-1, 3, CSPStage, [512]], # 64  40*40*512                               to head

   [58, 1, Conv, [256, 3, 2]], # 65
   [64, 1, Conv, [256, 3, 2]], # 66
   [[-1, -2, 54], 1, Concat, [1]], # 67  20*20*1024
   [-1, 3, CSPStage, [1024]],  # 68                                          to head

   [61, 1, RepConv, [256, 3, 1]],
   [64, 1, RepConv, [512, 3, 1]],
   [68, 1, RepConv, [1024, 3, 1]],

   [[69,70,71], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
